# vsoPreModifyID

## Description
Sends the event to a Script object before modifying.

```pascal
FUNCTION vsoPreModifyID(message : LONGINT) : INTEGER;
```

```python

def vs.vsoPreModifyID(message):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|LONGINT||

## Version
Availability: from Vectorworks 2024
## Category
* Object Events